Revit 2026 API

# UIThemeManager Class

---

Manager object for the UITheme class.

SystemObject Autodesk.Revit.UIUIThemeManager

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class UIThemeManager
```
```vb
Public NotInheritable Class UIThemeManager
```
```cpp
public ref class UIThemeManager abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type UIThemeManager = class end
```

The UIThemeManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentCanvasTheme | current canvas theme. |
|  | CurrentTheme | The current overall theme which impacts the Revit frame and canvas. |
|  | FollowSystemColorTheme | Indicate if the overall theme follows operating system color theme. |

|  | Name | Description |
| --- | --- | --- |
|  | GetThemeName | Gets the theme name for the given theme type. |

#### Reference

Autodesk.Revit.UI Namespace